Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Номенклатура.Пустая() Тогда
		ОбщиеФункцииМолочногоПроизводства.ДобавитьОшибку(
			Отказ, "Не указана номенклатура", "Номенклатура"
		);
		Возврат;
	КонецЕсли;
	
	Если Количество <= 0 Тогда
		ОбщиеФункцииМолочногоПроизводства.ДобавитьОшибку(
			Отказ, "Количество должно быть больше нуля", "Количество"
		);
		Возврат;
	КонецЕсли;
	
	Если Спецификация.Пустая() Тогда
		ОбщиеФункцииМолочногоПроизводства.ДобавитьОшибку(
			Отказ, "Не указана спецификация", "Спецификация"
		);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
КонецПроцедуры