&НаКлиенте
Процедура ВыполнитьТесты(Команда)

    ВыполнитьТестыНаСервере();

    ВсегоТестов =
        РезультатыТестов.Количество();

    Успешно = 0;

    Для Каждого Стр Из РезультатыТестов Цикл

        Если Стр.Статус = "Пройден" Тогда

            Успешно = Успешно + 1;

        КонецЕсли;

    КонецЦикла;

    Ошибок =
        ВсегоТестов - Успешно;

КонецПроцедуры
	
&НаСервере
Процедура ВыполнитьТестыНаСервере()

    Результаты =
    UT_МолочногоПроизводства.ВыполнитьВсеТесты();

	РезультатыТестов.Очистить();

	Для Каждого Стр Из Результаты Цикл

	    НоваяСтрока =
	        РезультатыТестов.Добавить();

	    НоваяСтрока.Тест =
	        Стр.Тест;

	    НоваяСтрока.Статус =
	        Стр.Статус;

	    НоваяСтрока.Комментарий =
	        Стр.Комментарий;

		КонецЦикла; 
		
    Ошибок =
        ВсегоТестов - Успешно;

КонецПроцедуры     

